app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
        <td><%= post.body %></td>
        <td><%= post.user.first_name %> <%= post.user.last_name %></td>