app/views/posts/latest.html.erb

        <td><%= link_to post.body.lines.take(1.5).join, post %></td>
        <td><%= post.user.first_name %> <%= post.user.last_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]