app/views/posts/popular.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---

 <p><%= post.user.first_name %> <%= post.user.last_name %>, <%= post.read_count %>