app/controllers/home_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."read_count" DESC LIMIT 3
---
  def index
    @q = Post.ransack(params[:q])
    if params[:q].present?
      @post = @q.result(distinct: true)

      #@posts.Post.all

    end
    @recent_posts = Post.all.order(read_count: :desc).limit(3)