app/controllers/posts_controller.rb

  def popular
    @posts = Post.all.order(read_count: :desc)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."read_count" DESC

  def latest
    @posts = Post.all.order(date: :desc)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."date" DESC

  def show
    @post.increment!(:read_count)
---
UPDATE "posts" SET "read_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["read_count", 1], ["updated_at", "2015-11-02 21:35:42.846352"], ["id", 2]]

  def create
    @post = Post.new(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "location", "body", "photo_url", "date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "photo" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["photo", "IN08_FOG1_346652f.jpg"], ["updated_at", "2015-11-03 14:52:00.392045"], ["id", 2]]