app/views/profile/show.html.erb

    <p><%= link_to post.body.lines.take(1).join, post %></p>
    <p><%= post.user.first_name %> <%= post.user.last_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]